CSI API ETABS v1
cLoadPatterns.GetAutoWindCode Method
 Retrieves the code name used for auto wind parameters in Wind-type load patterns.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAutoWindCode(
	string Name,
	ref string CodeName
)
Function GetAutoWindCode (
	Name As String,
	ByRef CodeName As String
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim CodeName As String
Dim returnValue As Integer
returnValue = instance.GetAutoWindCode(Name,
	CodeName)
int GetAutoWindCode(
	String^ Name,
	String^% CodeName
)
abstract GetAutoWindCode :
        Name : string *
        CodeName : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing Wind-type load pattern.
CodeName
Type: System.String
 This is either blank or the name code used for the auto wind parameters. Blank means no auto wind load is specified for the Wind-type load pattern.
Return Value
Type: Int32
 Returns zero if the code is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 An error is returned if the specified load pattern is not a Wind-type load pattern.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim CodeName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add new load pattern
       ret = SapModel.LoadPatterns.Add("WIND", LTYPE_WIND)
   'get auto wind code
       ret = SapModel.LoadPatterns.GetAutoWindCode("WIND", CodeName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace